Revit 2026 API

# NoiseNoiseThresholdHigh Property

---

The property labeled "High" from the "Noise" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string NoiseThresholdHigh { get; }
```
```vb
Public Shared ReadOnly Property NoiseThresholdHigh As String
	Get
```
```cpp
public:
static property String^ NoiseThresholdHigh {
	String^ get ();
}
```
```fsharp
static member NoiseThresholdHigh : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

Noise Class

Autodesk.Revit.DB.Visual Namespace